Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/ПС_ОбработкаДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПС_ОбработкаДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Распознан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Найден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прикреплен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Создан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИзвлеченныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ПС_ТипыРаспознанныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеСодержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксПолейКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксПолейОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Enums/ПС_ВариантыИдентификацииСторонДокументов/ПС_ВариантыИдентификацииСторонДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПС_ВариантыИдентификацииСторонДокументов</name>
  <enumValues>
    <name>ИНН</name>
  </enumValues>
  <enumValues>
    <name>ОКПО</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Enums/ПС_ТипыРаспознанныхДокументов/ПС_ТипыРаспознанныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПС_ТипыРаспознанныхДокументов</name>
  <enumValues>
    <name>ПоступлениеТоваровИУслуг</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровИУслуг</name>
  </enumValues>
  <enumValues>
    <name>Счет</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураВходящий</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураИсходящий</name>
  </enumValues>
</mdclass:Enum>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиРаспознавания/ПС_НастройкиРаспознавания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_НастройкиРаспознавания</name>
  <predefined>
    <items>
      <name>АдресСервисаРаспознаванияДокументов</name>
      <description>Адрес сервиса распознавания документов</description>
    </items>
    <items>
      <name>ЛогинN8N</name>
      <description>Логин сервиса</description>
    </items>
    <items>
      <name>ПарольN8N</name>
      <description>Пароль сервиса</description>
    </items>
    <items>
      <name>ОсновнаяЛицензия</name>
      <description>Основная лицензия</description>
    </items>
    <items>
      <name>РезервнаяЛицензия</name>
      <description>Резервная лицензия</description>
    </items>
    <items>
      <name>ИспользоватьКомпонентуОкантовки</name>
      <description>Использовать компоненту окантовки</description>
    </items>
    <items>
      <name>ПорогТочностиДляДополнительногоПоискаИИ</name>
      <description>Порог точности для дополнительного поиска ИИ</description>
    </items>
    <items>
      <name>ПорогТочностиДляПрикрепленияДокументов</name>
      <description>Порог точности для прикрепления документов</description>
    </items>
    <items>
      <name>ГлубинаИИПоискаМес</name>
      <description>Глубина ИИ поиска (мес)</description>
    </items>
    <items>
      <name>КоличествоСтрокДляПоискаДокументаИИ</name>
      <description>Количество строк для поиска документа ИИ</description>
    </items>
    <items>
      <name>КоличествоПопытокАвтоматическогоРаспознавания</name>
      <description>Количество попыток автоматического распознавания</description>
    </items>
    <items>
      <name>ИнтервалАвтоматическойОбработкиМин</name>
      <description>Интервал автоматической обработки мин</description>
    </items>
    <items>
      <name>ОткрыватьСканированиеПриНачалеРаботы</name>
      <description>Открывать сканирование при начале работы</description>
    </items>
    <items>
      <name>СоздаватьКонтрагентовАвтоматическиПриЗагрузке</name>
      <description>Создавать контрагентов автоматически при загрузке</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_КаталогиПотоковогоСканирования/ПС_КаталогиПотоковогоСканирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_КаталогиПотоковогоСканирования</name>
  <predefined>
    <items>
      <name>КаталогДляОбработанныхДокументов</name>
      <description>Каталог для обработанных </description>
    </items>
  </predefined>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/CommonModules/ПС_ИндексацияФайловВызовСервера/Module.bsl
//Идеи для дальнейшей реализации
//TODO: добавить мастер начала работы, где по шагам проходишь и выбираешь нужные параметры
//TODO: отправлять bp 1C заявку нам на создание бота+n8n для подключения в этой программе

#Область ПрограммныйИнтерфейс

//Обрабатывает документ по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//  АдресФайлаНаКлиенте - Строка - Адрес файла на клиенте
//	РучнойЗапуск - Булево - Признак ручного запуска обработки
//	ДокументИД - Строка, УникальныйИдентификатор - Идентификатор документа
Процедура ОбработатьДокумент(ХешСумма, АдресФайлаНаКлиенте = "", Знач РучнойЗапуск = Ложь, ДокументИД = Неопределено) Экспорт
	
	НаборЗаписейРегистра = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.ХешСумма.Установить(ХешСумма);
	
	Если ДокументИД <> Неопределено Тогда
		
		НаборЗаписейРегистра.Отбор.Объект.Установить(ДокументИД);
		
	КонецЕсли;
	
	НаборЗаписейРегистра.Прочитать();
	
	Если НаборЗаписейРегистра.Количество() > 0 Тогда
	
		ПорогПопыток = НастройкаРаспознаванияЧисло("КоличествоПопытокАвтоматическогоРаспознавания", 2);	
	
		ЗаписьРегистра = НаборЗаписейРегистра[0];
		
		ЗагрузкаНовогоДокумента = ТипЗнч(ЗаписьРегистра.Объект) = Тип("Строка") И НЕ ПустаяСтрока(ЗаписьРегистра.Объект);
		
		Если НЕ РучнойЗапуск И (ЗаписьРегистра.КоличествоПопыток > ПорогПопыток ИЛИ ЗагрузкаНовогоДокумента) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки + ?(ПустаяСтрока(ЗаписьРегистра.КомментарийОбработки), "", Символы.ПС) 
		+ "[" + Строка(ТекущаяДатаСеанса()) + "]" + Символы.ПС;
		ЗаписьРегистра.КоличествоПопыток = НаборЗаписейРегистра[0].КоличествоПопыток + 1; 
	
		Если НЕ ЗаписьРегистра.Распознан Тогда
			
			РаспознатьДокумент(ЗаписьРегистра, АдресФайлаНаКлиенте);	
			НаборЗаписейРегистра.Записать();		
			
		КонецЕсли;
			
		Если ЗаписьРегистра.Распознан И НЕ ЗаписьРегистра.Найден Тогда
				
			НайтиСвязиПоКлючевымРеквизитам(ЗаписьРегистра, ЗагрузкаНовогоДокумента);
			НаборЗаписейРегистра.Записать();
				
		КонецЕсли;
					
		Если НЕ ЗагрузкаНовогоДокумента Тогда
		

			Если ЗаписьРегистра.Найден И НЕ ЗаписьРегистра.Прикреплен Тогда
			
				ПорогПрикрепленияФайла = НастройкаРаспознаванияЧисло("ПорогТочностиДляПрикрепленияДокументов", 95);
				
				Если ЗаписьРегистра.Вероятность >= ПорогПрикрепленияФайла Тогда
				
					ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
					+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Точность поиска достаточна, чтобы прикрепить скан документа в автоматическом режиме";			
				
					Если ЗаписьРегистра.НаКлиенте Тогда
						
						ПрикрепитьСканДокументаНаСервере(ЗаписьРегистра, АдресФайлаНаКлиенте);
						
					Иначе
						
						ПрикрепитьСканДокументаНаСервере(ЗаписьРегистра, ЗаписьРегистра.ИмяФайла); //Прикрепляем файл, который хранится на сервере
						
					КонецЕсли;		
							
					НаборЗаписейРегистра.Записать();						
					
				КонецЕсли;
		
			КонецЕсли;
			
			Если ЗаписьРегистра.Прикреплен И НЕ ЗаписьРегистра.ОбработкаЗавершена Тогда					
							
				ЗавершитьОбработкуДокументаНаСервере(ЗаписьРегистра);
							
			КонецЕсли;
			
			//!!! После всех поисков нужно сверять суммы, контрагентов, даты, номера. Если документ найден, но совпадение не полное, подсвечивать
			
			НаборЗаписейРегистра.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает значение параметра распознавания
// Параметры:
//	ИмяНастройки - Строка - Имя настройки
// Возвращаемое значение:
//	Строка - Значение настройки
//
Функция ПолучитьНастройкуРаспознавания(ИмяНастройки) Экспорт

	Возврат Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания(ИмяНастройки);
	
КонецФункции

//Переупаковывает PDF файл
//Параметры:
//МассивДанных - Массив из Структура
//Возвращаемое значение:
//	Строка - Адрес файла на сервере
Функция ПереупаковатьPDF(МассивДанных) Экспорт
	
	Макет = ПолучитьОбщийМакет("МакетДляСборки");
	ТабДок = Новый ТабличныйДокумент;
	
	Для каждого ТекЭлемент Из МассивДанных Цикл
			
		ДвоичныеДанные = ТекЭлемент.Картинка;
			
		Если ДвоичныеДанные <> Неопределено Тогда
				
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть("Изображение");
			Рисунок = Область.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рисунок.Высота = 297;
			Рисунок.Ширина = 210;
			Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
			Рисунок.ГраницаСверху = Истина;
			Рисунок.ГраницаСнизу = Истина;
			Рисунок.ГраницаСправа = Истина;
			Рисунок.ГраницаСлева = Истина;
				
			Рисунок.Картинка = Новый Картинка(ДвоичныеДанные);
			Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 3);
			ТабДок.Вывести(Область);
				
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	ОбластьТекст = Макет.ПолучитьОбласть("СтрокаТекста");
			
	Для каждого ТекЭлемент Из МассивДанных Цикл
			
        Текст = ТекЭлемент.Текст;
            
		Если Текст = Неопределено Тогда
				
			Продолжить;
				
		КонецЕсли;
			
		Для Счетчик = 1 По СтрЧислоСтрок(Текст) Цикл
				
			СтрокаТекст = СтрПолучитьСтроку(Текст,Счетчик);
			ОбластьТекст.Параметры.Текст = СокрЛП(СтрокаТекст);
			ТабДок.Вывести(ОбластьТекст);
				
		КонецЦикла;
			
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
	КонецЦикла;	
				
	ТабДок.АвтоМасштаб = истина;
	ТабДок.ШиринаСтраницы = 210;
	ТабличныйДокумент = ТабДок;	
		
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура сбрасывает флаги в регистре для обновления документа
//
// Параметры:
//  ХешСумма - Строка - Хеш сумма файла
//  СсылкаНаДокумент - ДокументСсылка - Ссылка на документ
//
Процедура СброситьФлагиВРегистреДляОбновленияДокумента(ХешСумма, СсылкаНаДокумент) Экспорт
	
	//TODO: Используем набор записей, а не менеджер, т.к. есть ещё измерение "Период", 
	//возможно лишее и нужно сделать регистр непереодический, чтобы работать через менеджер
	
	НаборЗаписейРегистра = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.ХешСумма.Установить(ХешСумма);
	НаборЗаписейРегистра.Отбор.Объект.Установить(СсылкаНаДокумент);	
	НаборЗаписейРегистра.Прочитать();

	Если НаборЗаписейРегистра.Количество() > 0 Тогда
		
		ЗаписьРегистра = НаборЗаписейРегистра[0];
		
		ЗаписьРегистра.Найден = Ложь;
		ЗаписьРегистра.ОбработкаЗавершена = Ложь;
		ЗаписьРегистра.Контрагент = Неопределено; //Сбрасываем, т.к. возможно, его нужно будет повторно создать по распознанным данным
		ЗаписьРегистра.Вероятность = 0;
		
		НаборЗаписейРегистра.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Привязывает запись регистра к созданному документу
//
// Параметры:
//  ХешСумма - Строка - Хеш сумма файла
//  ВременныйИД - Строка - Временный строковый идентификатор файла до привязки к документу (буферный ИД)
//  СсылкаНаДокумент - УникальныйИдентификатор - Ссылка на созданный документ
Процедура ПривязатьЗаписьРегистраКСозданномуДокументу(ХешСумма, ВременныйИД, СсылкаНаДокумент) Экспорт
	
	НаборЗаписейРегистра = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.ХешСумма.Установить(ХешСумма);	
	НаборЗаписейРегистра.Прочитать();

	Найден = Ложь;

	Для каждого ТекЗапись Из НаборЗаписейРегистра Цикл
	
		Если ТекЗапись.Объект = ВременныйИД Тогда
	
		ТекЗапись.Объект = СсылкаНаДокумент;
		ТекЗапись.Найден = Истина;
		ТекЗапись.Вероятность = 100;
		
		ТекЗапись.КомментарийОбработки = ТекЗапись.КомментарийОбработки 
		+ ?(ТекЗапись.КомментарийОбработки  = "", "", Символы.ПС) + "Создан/обновлен документ по распознанным данным, привязка установлена";
		
		Найден = Истина;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если Найден Тогда
		
		НаборЗаписейРегистра.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

//Прикрепляет скан документа и завершает обработку документа
//
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла, используется как идентификатор
//	АдресХранилища - Строка - Адрес файла во временном хранилище
Процедура ПрикрепитьИЗавершитьОбработкуДокумента(ХешСумма, АдресХранилища) Экспорт
	
	НаборЗаписейРегистра = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.ХешСумма.Установить(ХешСумма);
	НаборЗаписейРегистра.Прочитать();
	
	Если НаборЗаписейРегистра.Количество() > 0 Тогда
	
		ЗаписьРегистра = НаборЗаписейРегистра[0];
	
		Если НЕ ЗаписьРегистра.Прикреплен Тогда
	
			ПрикрепитьСканДокументаНаСервере(ЗаписьРегистра, АдресХранилища); //Прикрепляем файл, который хранится на сервере
						
			НаборЗаписейРегистра.Записать();
			
		КонецЕсли;
		
		Если ЗаписьРегистра.Прикреплен И НЕ ЗаписьРегистра.ОбработкаЗавершена Тогда					
						
			ЗавершитьОбработкуДокументаНаСервере(ЗаписьРегистра);
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Возвращает файл с сервера
//Параметры:
//	ИмяФайла - Строка - Имя файла
//Возвращаемое значение:
//	ДвоичныеДанные - Двоичные данные файла
Функция ПолучитьФайлССервера(ИмяФайла) Экспорт

	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	
КонецФункции

//Возвращает файл с сервера
//Параметры:
//	ТипПлатформы - Строка - тип платформы клиента/сервера
//	ПоместитьВХранилище - Булево - признак помещения в хранилище, иначе возвращаем двоичные данные как есть
//Возвращаемое значение:
//	ДвоичныеДанные - Двоичные данные файла
Функция ПолучитьКомпонентыКонвертацииССервера(ТипПлатформы, ПоместитьВХранилище = Истина) Экспорт
	
	Если СтрНайти(ТипПлатформы,"Windows x86-64") > 0 Тогда
		 
		ДвДанные = ПолучитьОбщийМакет("NativeComp_x64");
		
	ИначеЕсли СтрНайти(ТипПлатформы,"Windows") > 0 Тогда
		
		ДвДанные = ПолучитьОбщийМакет("NativeComp_x86");
		
	Иначе
		
		ВызватьИсключение "Платформа не поддерживается текущей компонентой";
		
	КонецЕсли;
	
	Если ПоместитьВХранилище Тогда

		Возврат ПоместитьВоВременноеХранилище(ДвДанные);
		
	Иначе
		
		Возврат ДвДанные;
		
	КонецЕсли;
	
КонецФункции
//Возвращает тип ОС
//Возвращаемое значение:
//Булево
Функция ЭтоСерверLinux() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

//Возвращает данные регистра по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//  Идентификатор - УникальныйИдентификатор,Строка
//Возвращаемое значение:
//Массив из Структура - Результат запроса
Функция ПолучитьДанныеРегистраПоХешСумме(ХешСумма, Идентификатор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.ПС_ОбработкаДокументов КАК ПС_ОбработкаДокументов
	|ГДЕ
	|	ПС_ОбработкаДокументов.ХешСумма = &ХешСумма
	|	И (НЕ ПС_ОбработкаДокументов.ОбработкаЗавершена ИЛИ &ОтбиратьПоОбъекту)
	|	И (ПС_ОбработкаДокументов.Объект = &Объект
	|	ИЛИ НЕ &ОтбиратьПоОбъекту)";
	
	Запрос.УстановитьПараметр("ХешСумма", ХешСумма);
	Запрос.УстановитьПараметр("Объект", Идентификатор);
	Запрос.УстановитьПараметр("ОтбиратьПоОбъекту", Идентификатор <> Неопределено);
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();	
	
	РезультатМассив = Новый Массив;
	
	СтруктураСтрока = Новый Структура;
	
	Для каждого ТекКолонка Из ТаблицаЗначений.Колонки Цикл
		
		СтруктураСтрока.Вставить(ТекКолонка.Имя);
		
	КонецЦикла;
	
	Для каждого ТекСтрока Из ТаблицаЗначений Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, ТекСтрока);
		РезультатМассив.Добавить(СтруктураСтрока);
		
	КонецЦикла;	
	
	Возврат РезультатМассив;
	
КонецФункции

// Возвращает массив каталогов
//Параметры:
// КаталогиНаКлиенте - булево
// Возвращает массив Обрабатываемых каталогов с полями:
//	ПутьНаСервере - строка
//	НаКлиенте - булево
//Возвращаемое значение:
//	Тип: массив структур
Функция ПолучитьИндексируемыеКаталоги(КаталогиНаКлиенте = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПС_КаталогиПотоковогоСканирования.Ссылка КАК Ссылка,
		|	ПС_КаталогиПотоковогоСканирования.ПутьККаталогу КАК ПутьККаталогу,
		|	ПС_КаталогиПотоковогоСканирования.НаКлиенте КАК НаКлиенте
		|ИЗ
		|	Справочник.ПС_КаталогиПотоковогоСканирования КАК ПС_КаталогиПотоковогоСканирования
		|ГДЕ
		|	ПС_КаталогиПотоковогоСканирования.Активен
		|	И
		|		ПС_КаталогиПотоковогоСканирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.ПС_КаталогиПотоковогоСканирования.КаталогДляОбработанныхДокументов)
		|	И (&КаталогиНаКлиенте = НЕОПРЕДЕЛЕНО
		|	ИЛИ ПС_КаталогиПотоковогоСканирования.НаКлиенте = &КаталогиНаКлиенте)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаКлиенте";
	
	Запрос.УстановитьПараметр("КаталогиНаКлиенте", КаталогиНаКлиенте);
	
	ВыборкаКаталогов = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаКаталогов.Следующий() Цикл
		
		СтруктураКаталога = Новый Структура;
		СтруктураКаталога.Вставить("ПутьККаталогу", ВыборкаКаталогов.ПутьККаталогу);
		СтруктураКаталога.Вставить("НаКлиенте", ВыборкаКаталогов.НаКлиенте);
		
		Результат.Добавить(СтруктураКаталога);
		
	КонецЦикла;
	
	Возврат Результат;	
		
КонецФункции

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПолучитьИндексируемыеКаталоги(Ложь);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаСервере = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаСервере.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				ХешСумма = ПолучитьХешСуммуФайла(Файл.ПолноеИмя);

				ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма);

			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Добавляет файл в регистр
//Параметры:
//	ПутьКФайлу - строка
//	ХешСумма - строка
//	ФайлНаКлиенте - булево
//	СвязанныйОбъект - УникальныйИдентификатор - ссылка на объект
Процедура ДобавитьФайлВРегистр(ПутьКФайлу, ХешСумма, ФайлНаКлиенте = Ложь, СвязанныйОбъект = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ХешСумма.Установить(ХешСумма);
	
	Если СвязанныйОбъект <> Неопределено Тогда
		
		НаборЗаписей.Отбор.Объект.Установить(СвязанныйОбъект);
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
				
	Если НаборЗаписей.Количество() = 0 Тогда
				
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.ХешСумма = ХешСумма;
		НоваяЗапись.ИмяФайла = ПутьКФайлу;
		НоваяЗапись.НаКлиенте = ФайлНаКлиенте;
					
		Если СвязанныйОбъект <> Неопределено Тогда
		
			НоваяЗапись.Объект = СвязанныйОбъект;
		
		КонецЕсли;					
					
		НаборЗаписей.Записать();
					
	КонецЕсли;	
	
	НаборЗаписей = Неопределено;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Истина, если переданное имя реквизита является ключевым
// 
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита

Функция ЭтоКлючевойРеквизит(ИмяРеквизита) Экспорт
	
	МассивКлючевых = Новый Массив;
	МассивКлючевых.Добавить("INN_client");
	МассивКлючевых.Добавить("INN_company");
	МассивКлючевых.Добавить("OKPO_client");
	МассивКлючевых.Добавить("OKPO_company");	
	МассивКлючевых.Добавить("OKUD");	
	МассивКлючевых.Добавить("date");
	МассивКлючевых.Добавить("number");
	МассивКлючевых.Добавить("doc_type");
	МассивКлючевых.Добавить("summ");
	МассивКлючевых.Добавить("content_min");
	МассивКлючевых.Добавить("content_type");
	
	Возврат МассивКлючевых.Найти(ИмяРеквизита) <> Неопределено;
	
КонецФункции

// Процедура сериализует все данные распознавания в реквизиты
//Параметры:
//	ДанныеРаспознавания - Структура - данные распознавания
Процедура СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания) Экспорт

	ДанныеРаспознавания.Вставить("Реквизиты", JSONВСтруктуру(ДанныеРаспознавания.ИзвлеченныйТекст));
	
КонецПроцедуры


// Функция возвращает данные о файле по хеш сумме
//Параметры:
//	ХешСумма - Строка - хеш сумма файла
//	Идентификатор - Строка - идентификатор файла
//Возвращаемое значение:
//	Структура,Неопределено,Произвольный - данные файла
Функция ДанныеОдногоФайлаПоХешСумме(ХешСумма, Идентификатор = Неопределено) Экспорт

	//Получаем файл
	ДанныеФайлаМассив = ПолучитьДанныеРегистраПоХешСумме(ХешСумма, Идентификатор);
	
	Если ДанныеФайлаМассив.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ДанныеФайла = ДанныеФайлаМассив[0];
		
	КонецЕсли;
	
	Возврат ДанныеФайла;
	
КонецФункции

// Функция преобразует структуру в JSON
//Параметры:
//	Структура - Структура - структура для преобразования
//Возвращаемое значение:
//	Строка - JSON
Функция СтруктураВJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализации);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Функция преобразует JSON в структуру
//Параметры:
//	СтрокаJSON - Строка - JSON для преобразования
//Возвращаемое значение:
//	Структура - структура
Функция JSONВСтруктуру(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрикрепитьСканДокументаНаСервере(ЗаписьРегистра, АдресХранилищаИлиПуть) Экспорт
	
	Если ТипЗнч(ЗаписьРегистра.Объект) = Тип("Строка") Тогда
		
		ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
		+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Не удалось прикрепить файл";
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаИлиПуть) Тогда
	
		АдресВХранилище = АдресХранилищаИлиПуть;
		
	Иначе
	
		АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(АдресХранилищаИлиПуть));
		
	КонецЕсли;
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ИмяБезРасширения = ЗаписьРегистра.ПредставлениеДокумента;
	ПараметрыФайла.РасширениеБезТочки = "pdf";
	//@skip-check bsl-legacy-check-expression-type
	ПараметрыФайла.ВладелецФайлов = ЗаписьРегистра.Объект;
	
	Попытка
	
		СсылкаНаФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла,
		АдресВХранилище);
		
		Если НЕ СсылкаНаФайл.Пустая() Тогда
			
			ЗаписьРегистра.Прикреплен = Истина;
			ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
			+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Файл прикреплен к докумкенту успешно";			
			
		КонецЕсли;
		
	
		
	Исключение

		ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
		+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Не удалось прикрепить файл к документу";			
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗавершитьОбработкуДокументаНаСервере(ЗаписьРегистра) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПС_ПравилаЗавершенияОбработкиДокументовРасширение.ИмяРеквизита КАК ИмяРеквизита,
		|	ПС_ПравилаЗавершенияОбработкиДокументовРасширение.ФормулаРасчетаЗначения КАК ФормулаРасчетаЗначения,
		|	ПС_ПравилаЗавершенияОбработкиДокументовРасширение.БСП КАК БСП
		|ИЗ
		|	РегистрСведений.ПС_ПравилаЗавершенияОбработкиДокументов КАК ПС_ПравилаЗавершенияОбработкиДокументовРасширение
		|ГДЕ
		|	ПС_ПравилаЗавершенияОбработкиДокументовРасширение.Активно
		|	И ПС_ПравилаЗавершенияОбработкиДокументовРасширение.ТипДокумента = &ТипДокумента";
	
	Запрос.Параметры.Вставить("ТипДокумента", ЗаписьРегистра.ТипДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДокОбъект = ЗаписьРегистра.Объект.ПолучитьОбъект();
	
	Пока Выборка.Следующий() Цикл
		
		УстановитьБезопасныйРежим(Истина);			
		Значение = Вычислить(Выборка.ФормулаРасчетаЗначения);
		УстановитьБезопасныйРежим(Ложь);		
		
		Если Выборка.БСП Тогда
		
			СвВо = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", Выборка.ИмяРеквизита);
			
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			ТабДополниительныеРеквизиты =ДокОбъект.ДополнительныеРеквизиты;
			
			Найденный = ТабДополниительныеРеквизиты.Найти(СвВо, "Свойство");
			
			Если Найденный = Неопределено Тогда
				
				Найденный = ТабДополниительныеРеквизиты.Добавить();
				Найденный.Свойство = СвВо;
				
			КонецЕсли;
			
			Найденный.Значение = Значение;
			
		Иначе
			
			ДокОбъект[Выборка.ИмяРеквизита] = Значение;			
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ЗаписьРегистра.ОбработкаЗавершена = Истина;
	ЗаписьРегистра.ОкончаниеОбработки = ТекущаяДатаСеанса();
	
	ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
	+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Обработка документа завершена";			
	
КонецПроцедуры

Функция ПолучитьСконвертированныйСканНаСервере(ИмяФайла)

	Слэш = ?(ЭтоСерверLinux(), "/", "\");

	//Получаем компоненту конвертации
	КаталогКомпоненты = КаталогВременныхФайлов() + "PSTools";
	
	КаталогНаКлиенте = Новый Файл(КаталогКомпоненты);
	
	Если НЕ КаталогНаКлиенте.Существует() Тогда
		
		СоздатьКаталог(КаталогКомпоненты);
		
	КонецЕсли;
	
	ИмяФайлаКомпоненты = "PdfToStream.dll";
	
	СисИнфо = Новый СистемнаяИнформация;
	
	ПолноеИмяФайлаКомпоненты = КаталогКомпоненты + Слэш + ИмяФайлаКомпоненты;
	
	Если НайтиФайлы(КаталогКомпоненты, ИмяФайлаКомпоненты).Количество() = 0 Тогда
	
		ДД_Компоненты = ПолучитьКомпонентыКонвертацииССервера(СисИнфо.ТипПлатформы, Ложь);	
		
		ДД_Компоненты.Записать(ПолноеИмяФайлаКомпоненты);
		
	КонецЕсли;
	
	МассивДанных = Неопределено;
	
	Если ПодключитьВнешнююКомпоненту(ПолноеИмяФайлаКомпоненты,"VK",ТипВнешнейКомпоненты.Native) Тогда  
	
		Компонента = Новый("AddIn.VK.PdfToStream");
		Результат = Компонента.ЗагрузитьPDF(ИмяФайла);

		Если Результат Тогда
				
			МассивДанных = Новый Массив;
			
			КоличествоСтраниц = Компонента.КоличествоСтраницВДокументе;
			
			Для Ы = 0 По КоличествоСтраниц -1 Цикл	
			
				КартинкаДокумента = Компонента.ПолучитьСтраницу(Ы);
				ТекстДокумента = Компонента.ПолучитьТекстСтраницы(Ы);
				СтруктураДанных = Новый Структура("Картинка, Текст", КартинкаДокумента, ТекстДокумента);
			
				МассивДанных.Добавить(СтруктураДанных);
				
			КонецЦикла;			

		КонецЕсли;
						
	Иначе
							
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось подключить компоненту на сервере";
		СообщениеПользователю.Сообщить();							

	КонецЕсли;
	
	Возврат МассивДанных;
	
КонецФункции

Процедура РаспознатьДокумент(ЗаписьРегистра, АдресФайлаНаКлиенте = "")
	
	//РезультатУспешноРаспознан = Ложь;
	
	НужноУдалитьФайл = Ложь;
	
	Если ЗаписьРегистра.НаКлиенте И ЭтоАдресВременногоХранилища(АдресФайлаНаКлиенте) Тогда
		
		ДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресФайлаНаКлиенте);
		
		Если ТипЗнч(ДанныеИзХранилища) = Тип("Массив") Тогда //PDF сконвертирован на клиенте
		
			ДокументСОбрамлением = ПереупаковатьPDF(ДанныеИзХранилища);
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
			ДокументСОбрамлением.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
		
		ИначеЕсли ТипЗнч(ДанныеИзХранилища) = Тип("Структура") И ДанныеИзХранилища.Свойство("БылаПопыткаКонвертации") Тогда 
		
			ДокументБезОбрамления = ДанныеИзХранилища.ДвоичныеДанныеФайлаНаКлиенте;
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
			ДокументБезОбрамления.Записать(ИмяВременногоФайла);

			ПолноеИмяФайла = ИмяВременногоФайла;			
			
		Иначе //Сохраняем и конвертируем на сервере, т.к. предполагается, что это win сервер, иначе пришел бы массив
		
			Если ПолучитьНастройкуРаспознавания("ИспользоватьКомпонентуОкантовки") = Истина Тогда
		
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
				ДвоичныеДанные = ДанныеИзХранилища;
				ДвоичныеДанные.Записать(ИмяВременногоФайла);				
				
				ДД_PDF = ПолучитьСконвертированныйСканНаСервере(ИмяВременногоФайла);
				
				Если ДД_PDF <> Неопределено Тогда
					
					УдалитьФайлы(ИмяВременногоФайла);
					
					ДокументСОбрамлением = ПереупаковатьPDF(ДД_PDF);
					
					ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
					ДокументСОбрамлением.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
					
				КонецЕсли;
				
				ПолноеИмяФайла = ИмяВременногоФайла;
				
			Иначе	
							
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
				ДанныеИзХранилища.Записать(ИмяВременногоФайла);	
				ПолноеИмяФайла = ИмяВременногоФайла;
											
			КонецЕсли;
			
		КонецЕсли;
		
		НужноУдалитьФайл = Истина;
		
	Иначе

		ПолноеИмяФайла = ЗаписьРегистра.ИмяФайла;
		
		Если ПолучитьНастройкуРаспознавания("ИспользоватьКомпонентуОкантовки") = Истина Тогда
		
			ДД_PDF = ПолучитьСконвертированныйСканНаСервере(ПолноеИмяФайла);
				
			Если ДД_PDF = Неопределено Тогда
					
				Возврат;
					
			КонецЕсли;				
				
			ДокументСОбрамлением = ПереупаковатьPDF(ДД_PDF);
				
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
			ДокументСОбрамлением.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
			ПолноеИмяФайла = ИмяВременногоФайла;
			
			НужноУдалитьФайл = Истина;
			
		КонецЕсли;
				
	КонецЕсли;
	
	ДДСкана = Новый ДвоичныеДанные(ПолноеИмяФайла);
		
	//Отправка в N8N		
	РезультатОбработки = ПС_N8NВызовСервера.РаспознатьДокументN8N(ДДСкана);
		
	Если РезультатОбработки.ОбработанУспешно Тогда
			
			ЗаписьРегистра.ИзвлеченныйТекст = СтруктураВJSON(РезультатОбработки.РаспознанныеДанные);
			ЗаписьРегистра.КлючевыеРеквизиты = СтруктураВJSON(РезультатОбработки.КлючевыеРеквизиты);
			
			ЗаписьРегистра.Распознан = Истина;
			//РезультатУспешноРаспознан = Истина; 
			
	КонецЕсли;
		
	ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
	+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + РезультатОбработки.Комментарий;
	
	//Удаляем только временный файл, переписанный с клиента.
	//Если это исходный файл, его не трогаем
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;	
	
	Возврат;
	
КонецПроцедуры



//Под будущее развитие системы. Для определения имен документов и реквизитов
//которые разливаются в разных конфигурациях.
//@skip-check module-unused-method
Функция ПолучитьИменаМетаданныхКонфигурации()
	
	Результат = Новый Структура();
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//По умолчанию
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		//
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НайтиСвязиПоКлючевымРеквизитам(ЗаписьРегистра, ЗагрузкаНовогоДокумента = Ложь)
	
	ТочностьСтрогогоПоиска = 100;
	ТочностьПоискаИИ = 0;
	//БылПоискИИ = Ложь;
	
	СтруктураКлючевыхРеквизитов = JSONВСтруктуру(ЗаписьРегистра.КлючевыеРеквизиты);
	
	ЭтоИсходящийДокумент = Ложь;
	ЗаписьРегистра.Организация = Неопределено;
	ЗаписьРегистра.Контрагент = Неопределено;
	НастройкиЗагрузки = Неопределено;
	
	Если ЗначениеЗаполнено(СтруктураКлючевыхРеквизитов.OKUD) Тогда
		
		НастройкиЗагрузки = ПС_СозданиеНовыхОбъектовВызовСервера.ПолучитьНастройкиЗагрузкиДокумента(СтруктураКлючевыхРеквизитов.OKUD);
		
	КонецЕсли;
	
	//На данном этапе мы не думаем о том, кто поставщик, а кто покупатель
	//далее ниже поставщиком может оказаться как наша организация, так и контрагент
	//от этого зависит "направление" документа входящий/исходящий
	ИмяПоля_ИД_Поставщика = "INN_company";
	ИмяПоля_ИД_Клиента = "INN_client";
	РеквизитПоискаКонфигурации = "ИНН";
		
	Если НастройкиЗагрузки <> Неопределено Тогда
		
		Если НастройкиЗагрузки.ПриоритетныйВариантИдентификацииСторон = Перечисления.ПС_ВариантыИдентификацииСторонДокументов.ОКПО Тогда
			
			ИмяПоля_ИД_Поставщика = "OKPO_company";
			ИмяПоля_ИД_Клиента = "OKPO_client";
			РеквизитПоискаКонфигурации = "КодПоОКПО";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИНН_Поставщика = СокрЛП(СтруктураКлючевыхРеквизитов["INN_company"]);
	ОКПО_Поставщика = СокрЛП(СтруктураКлючевыхРеквизитов["OKPO_company"]);
	
	ИНН_Клиента = СокрЛП(СтруктураКлючевыхРеквизитов["INN_client"]);
	ОКПО_Клиента = СокрЛП(СтруктураКлючевыхРеквизитов["OKPO_client"]);
	
	ОпределитьОрганизацию(ЗаписьРегистра, ОКПО_Поставщика, ИНН_Поставщика, ТочностьСтрогогоПоиска, ЭтоИсходящийДокумент, Истина);
	ОпределитьОрганизацию(ЗаписьРегистра, ОКПО_Клиента, ИНН_Клиента, ТочностьСтрогогоПоиска, ЭтоИсходящийДокумент, Ложь);

	ОпределитьКонтрагента(ЗаписьРегистра, РеквизитПоискаКонфигурации, СокрЛП(СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Клиента]), ТочностьСтрогогоПоиска, ЭтоИсходящийДокумент, Истина);
	ОпределитьКонтрагента(ЗаписьРегистра, РеквизитПоискаКонфигурации, СокрЛП(СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Поставщика]), ТочностьСтрогогоПоиска, ЭтоИсходящийДокумент, Ложь);
	
	//Тип документа
	Если СтруктураКлючевыхРеквизитов.doc_type = "Акт" Тогда
	
		Если ЭтоИсходящийДокумент Тогда
			
			ЗаписьРегистра.ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.РеализацияТоваровИУслуг;
			
		Иначе
						
			ЗаписьРегистра.ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.ПоступлениеТоваровИУслуг;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураКлючевыхРеквизитов.doc_type = "Счет" Тогда
	
		ЗаписьРегистра.ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.Счет;
		
	ИначеЕсли СтруктураКлючевыхРеквизитов.doc_type = "Счет-Фактура" Тогда
		
		Если ЭтоИсходящийДокумент Тогда
			
			ЗаписьРегистра.ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.СчетФактураИсходящий;
			
		Иначе
						
			ЗаписьРегистра.ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.СчетФактураВходящий;
			
		КонецЕсли;	
			
	КонецЕсли;
	
	Если ЭтоИсходящийДокумент Тогда
		
		ЗаписьРегистра.ПрефиксПолейОрганизации = "company";
		ЗаписьРегистра.ПрефиксПолейКонтрагента = "client";	
		
		ИД_Организации = СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Поставщика];
		ИД_Контрагента = СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Клиента];
		
	Иначе
		
		ЗаписьРегистра.ПрефиксПолейОрганизации = "client";
		ЗаписьРегистра.ПрефиксПолейКонтрагента = "company";
		
		ИД_Организации = СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Клиента];
		ИД_Контрагента = СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Поставщика];
		
	КонецЕсли;
	
	ЗаписьРегистра.ОрганизацияИД = ИД_Организации;
	ЗаписьРегистра.КонтрагентИД = ИД_Контрагента;
	
	ЗаписьРегистра.Номер = СтруктураКлючевыхРеквизитов.number;
	ЗаписьРегистра.Дата = XMLЗначение(Тип("Дата"), СтруктураКлючевыхРеквизитов.date);
	
	ЗаписьРегистра.ТипСодержимого = СтруктураКлючевыхРеквизитов.content_type;
	ЗаписьРегистра.КраткоеСодержание = СтруктураКлючевыхРеквизитов.content_min;
	
	ЗаписьРегистра.ПредставлениеДокумента = СтрШаблон("%1 (%2) №%3 от %4 (%5 - %6)", 
	ЗаписьРегистра.ТипДокумента,
	ЗаписьРегистра.ТипСодержимого,
	ЗаписьРегистра.Номер,
	Формат(ЗаписьРегистра.Дата, "ДФ=dd.MM.yyyy;"),
	ЗаписьРегистра.Организация,
	ЗаписьРегистра.Контрагент);
	
	ЗаписьРегистра.Сумма = ПС_СлужебныеФункцииВызовСервера.Число2(СтруктураКлючевыхРеквизитов.summ);
		
	Если НЕ ЗагрузкаНовогоДокумента И НЕ ЗначениеЗаполнено(ЗаписьРегистра.Объект) Тогда
	
		Если ПустаяСтрока(ИД_Организации) ИЛИ ПустаяСтрока(ИД_Контрагента) Тогда
				
			ТекстКомментария = "Не определены ИНН (ОКПО) сторон документа, жесткий поиск невозможен";			
			ЗаписьРегистра.КомментарийОбработки = ?(ПустаяСтрока(ЗаписьРегистра.КомментарийОбработки), ТекстКомментария, ЗаписьРегистра.КомментарийОбработки + Символы.ПС + ТекстКомментария);	
			ТочностьСтрогогоПоиска = 0;
		
		Иначе
		
			НайтиДокументИБ(ЗаписьРегистра, ТочностьСтрогогоПоиска, ИД_Организации, ИД_Контрагента);
		
		КонецЕсли;
		
		ПорогПоискаИИ = НастройкаРаспознаванияЧисло("ПорогТочностиДляДополнительногоПоискаИИ", 100);
		
		Если ТочностьСтрогогоПоиска < ПорогПоискаИИ Тогда
		
			СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Поставщика] = ИД_Организации;
			СтруктураКлючевыхРеквизитов[ИмяПоля_ИД_Клиента] = ИД_Контрагента;
		
			НайтиДокументСПрименениемИИ(ЗаписьРегистра, ТочностьПоискаИИ, ТочностьСтрогогоПоиска, СтруктураКлючевыхРеквизитов);
			//БылПоискИИ = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ЗаписьРегистра.Объект) Тогда //Получается, нашли
			
			ЗаписьРегистра.Найден = Истина;
			
		КонецЕсли;
		
		ЗаписьРегистра.Вероятность = Макс(ТочностьПоискаИИ, ТочностьСтрогогоПоиска);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкаРаспознаванияЧисло(ИмяНастройки, ПоУмолчанию = 0) Экспорт
	
	ТекЗначение = ПолучитьНастройкуРаспознавания(ИмяНастройки);
	
	Результат = ПоУмолчанию;
	
	Если ТипЗнч(ТекЗначение) = Тип("Число") Тогда
		
		Результат = ТекЗначение;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьИДВременнойЗаписиРегистраПоХешу(ХешСумма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПС_ОбработкаДокументов.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ПС_ОбработкаДокументов КАК ПС_ОбработкаДокументов
	|ГДЕ
	|	ПС_ОбработкаДокументов.ХешСумма = &ХешСумма
	|	И ТИПЗНАЧЕНИЯ(ПС_ОбработкаДокументов.Объект) = ТИП(Строка)";	
			
	Запрос.Параметры.Вставить("ХешСумма", ХешСумма);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Объект;
		
	Иначе
		
		Возврат Неопределено;

	КонецЕсли;
	
КонецФункции

Процедура НайтиДокументСПрименениемИИ(ЗаписьРегистра, ТочностьПоискаИИ, ТочностьСтрогогоПоиска, СтруктураКлючевыхРеквизитов)

	НайденныйДокумент = Неопределено;
	
	ИмяТаблицыДокумента = ИмяТаблицыПоТипуДокумента(ЗаписьРегистра.ТипДокумента);
	ИменаПолейДатаНомер = ИменаПолейДатаНомер(ЗаписьРегистра.ТипДокумента);

	ГлубинаИИПоискаМес = НастройкаРаспознаванияЧисло("ГлубинаИИПоискаМес", 12);
	КоличествоСтрокДляПоискаДокументаИИ = НастройкаРаспознаванияЧисло("КоличествоСтрокДляПоискаДокументаИИ", 1);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА Документ.%2 = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Документ.Дата
		|		ИНАЧЕ Документ.%2
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА Документ.%3 = """"
		|			ТОГДА Документ.Номер
		|		ИНАЧЕ Документ.%3
		|	КОНЕЦ КАК Номер,
		|	Документ.Организация.ИНН КАК ИННОрганизации,
		|	Документ.Контрагент.ИНН КАК ИННКонтрагента,
		|	Документ.СуммаДокумента КАК Сумма,
		|	ДокументТовары.Номенклатура.Наименование КАК Содержание
		|ИЗ
		|	Документ.%1 КАК Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%1.Товары КАК ДокументТовары
		|		ПО Документ.Ссылка = ДокументТовары.Ссылка
		|		И ДокументТовары.НомерСтроки <= &КоличествоСтрокДляПоискаДокументаИИ
		|ГДЕ
		|	Документ.Организация.ИНН = &ИННОрганизации
		|	И Документ.Контрагент.ИНН = &ИННКонтрагента
		|	И (Документ.%2 МЕЖДУ &НачалоИнтервала И &КонецИнтервала
		|	ИЛИ Документ.Дата МЕЖДУ &НачалоИнтервала И &КонецИнтервала)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ИмяТаблицыДокумента);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%2", ИменаПолейДатаНомер.ИмяДата);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%3", ИменаПолейДатаНомер.ИмяНомер);
	Запрос.УстановитьПараметр("ИННОрганизации", СтруктураКлючевыхРеквизитов.INN_company);
	Запрос.УстановитьПараметр("ИННКонтрагента", СтруктураКлючевыхРеквизитов.INN_client);
	Запрос.УстановитьПараметр("КоличествоСтрокДляПоискаДокументаИИ", КоличествоСтрокДляПоискаДокументаИИ);
	Запрос.УстановитьПараметр("НачалоИнтервала", ДобавитьМесяц(НачалоГода(ЗаписьРегистра.Дата), -1 * ГлубинаИИПоискаМес)); 
	Запрос.УстановитьПараметр("КонецИнтервала", КонецГода(ЗаписьРегистра.Дата));

	МассивВариантов = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультатов = РезультатЗапроса.Выбрать();
	
	Если ВыборкаРезультатов.Количество() > 0 Тогда

		Пока ВыборкаРезультатов.Следующий() Цикл
			
			НовыйВариант = Новый Структура;
			НовыйВариант.Вставить("date", 			ВыборкаРезультатов.Дата);
			НовыйВариант.Вставить("number", 		ВыборкаРезультатов.Номер);
			НовыйВариант.Вставить("INN_company", 	ВыборкаРезультатов.ИННОрганизации);
			НовыйВариант.Вставить("INN_client", 	ВыборкаРезультатов.ИННКонтрагента);
			НовыйВариант.Вставить("summ", 			ВыборкаРезультатов.Сумма);
			НовыйВариант.Вставить("content_min", 	ВыборкаРезультатов.Содержание);
			
			МассивВариантов.Добавить(НовыйВариант);
			
		КонецЦикла;

		РезультатПоиска = ПС_N8NВызовСервера.ПоискДокументаN8N(СтруктураКлючевыхРеквизитов, МассивВариантов);
		
		Если РезультатПоиска.ОбработанУспешно Тогда
	
			ТочностьПоискаИИ = РезультатПоиска.Результат.accuracy;
	
			ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
			+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "ИИ нашел документ в базе с вероятностью " + Формат(ТочностьПоискаИИ, "ЧДЦ=2;") + "%" + Символы.ПС
			+ "Комментарий ИИ: " + РезультатПоиска.Результат.comment;
			
			Если ТочностьПоискаИИ >= ТочностьСтрогогоПоиска Тогда
			
				НайденныйДокумент = Документы[ИмяТаблицыПоТипуДокумента(ЗаписьРегистра.ТипДокумента)].НайтиПоНомеру(РезультатПоиска.Результат.number, РезультатПоиска.Результат.date);
			
				Если НЕ НайденныйДокумент.Пустая() Тогда
				
				
					ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
					+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Точность поиска ИИ оказалась больше точности обычного поиска, будет принята версия ИИ";
				
					ЗаписьРегистра.Объект = НайденныйДокумент;
					ЗаписьРегистра.Найден = Истина;
					
				КонецЕсли;
				
			Иначе
				
				ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
				+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Точность поиска ИИ оказалась меньше ожидаемой, будет принята версия обычного поиска 1С";
				
				Если ЗначениеЗаполнено(ЗаписьРегистра.Объект) Тогда
					
					ЗаписьРегистра.Найден = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
			+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "Не удалось выполнить поисковый запрос к ИИ " + РезультатПоиска.Комментарий;						
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
		+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + "В базе не найдено никаких вариантов документов по указанным ИНН, которые бы можно было предложить для поиска ИИ";
		
	КонецЕсли;
	
КонецПроцедуры


Функция ИмяТаблицыПоТипуДокумента(ТипДокумента)
	
	//!!! Тут нужно возвращать массив и если в массиве более 1 элемента, составлять динамически запрос.
	//Т.к. может быть поступление услуг и прочих активов и обычное поступлениие.
	
	Если ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.ПоступлениеТоваровИУслуг Тогда
		
		Возврат "ПриобретениеТоваровУслуг";
		
	ИначеЕсли ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.РеализацияТоваровИУслуг Тогда
		
		Возврат "РеализацияТоваровУслуг";
		
	КонецЕсли;
	
КонецФункции

Функция ИменаПолейДатаНомер(ТипДокумента)
	
	Если ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.ПоступлениеТоваровИУслуг Тогда
		
		Возврат Новый Структура("ИмяДата,ИмяНомер", "ДатаВходящегоДокумента", "НомерВходящегоДокумента");
		
	ИначеЕсли ТипДокумента = Перечисления.ПС_ТипыРаспознанныхДокументов.РеализацияТоваровИУслуг Тогда
		
		Возврат Новый Структура("ИмяДата,ИмяНомер", "Дата", "Номер");
		
	КонецЕсли;
	
КонецФункции

Процедура НайтиДокументИБ(ЗаписьРегистра, ТочностьСтрогогоПоиска, ИННОрганизации, ИННКонтрагента)

	//!!! В перспективе переделать все запросы на динамическое создание какой-то одной функцией

	ТочностьПоиска = 0;
	НайденныйДокумент = Неопределено;
	КомментарийАлгоритма = "";
	
	ИмяТаблицыДокумента = ИмяТаблицыПоТипуДокумента(ЗаписьРегистра.ТипДокумента);
	ИменаПолейДатаНомер = ИменаПолейДатаНомер(ЗаписьРегистра.ТипДокумента);

	// --- Шаг 1: Точный поиск по всем полям ---
	// Если в базе найден документ, по всем переданным параметрам, то точность = 100.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Документ.Ссылка
		|ИЗ
		|	Документ.%1 КАК Документ
		|ГДЕ
		|	Документ.Организация = &Организация
		|	И Документ.Контрагент = &Контрагент
		|	И (Документ.Дата Между &НачалоДня И &КонецДня ИЛИ Документ.%2 Между &НачалоДня И &КонецДня)
		|	И Документ.%3 ПОДОБНО &Номер
		|	И Документ.СуммаДокумента = &Сумма";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ИмяТаблицыДокумента);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%2", ИменаПолейДатаНомер.ИмяДата);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%3", ИменаПолейДатаНомер.ИмяНомер);
	Запрос.УстановитьПараметр("Организация", ЗаписьРегистра.Организация);
	Запрос.УстановитьПараметр("Контрагент", ЗаписьРегистра.Контрагент);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ЗаписьРегистра.Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ЗаписьРегистра.Дата));
	Запрос.УстановитьПараметр("Номер", ЗаписьРегистра.Номер);
	Запрос.УстановитьПараметр("Сумма", ЗаписьРегистра.Сумма);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НайденныйДокумент = Выборка.Ссылка;
		ТочностьПоиска = 100;
		КомментарийАлгоритма = "Найден документ по полному набору реквизитов. Точность: 100%";
		
	КонецЕсли;

	// --- Шаг 2: Поиск по ИНН (полный набор данных) ---
	// Если не найден, нужна вторая попытка поиска, но нужно искать не по ссылкам на Контрагента и организацию, а по ИНН контрагента и ИНН организации.
	// Если найден документ, также точность 100.
	Если НайденныйДокумент = Неопределено Тогда
		
		Если НЕ ПустаяСтрока(ИННОрганизации) И НЕ ПустаяСтрока(ИННКонтрагента) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Документ.Ссылка
				|ИЗ
				|	Документ.%1 КАК Документ
				|ГДЕ
				|	Документ.Организация.ИНН = &ИННОрганизации
				|	И Документ.Контрагент.ИНН = &ИННКонтрагента
				|	И (Документ.Дата Между &НачалоДня И &КонецДня ИЛИ Документ.%2 Между &НачалоДня И &КонецДня)
				|	И Документ.%3 = &Номер
				|	И Документ.СуммаДокумента = &Сумма";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ИмяТаблицыДокумента);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%2", ИменаПолейДатаНомер.ИмяДата);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%3", ИменаПолейДатаНомер.ИмяНомер);
			Запрос.УстановитьПараметр("ИННОрганизации", ИННОрганизации);
			Запрос.УстановитьПараметр("ИННКонтрагента", ИННКонтрагента);
			Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ЗаписьРегистра.Дата));
			Запрос.УстановитьПараметр("КонецДня", КонецДня(ЗаписьРегистра.Дата));
			Запрос.УстановитьПараметр("Номер", ЗаписьРегистра.Номер);
			Запрос.УстановитьПараметр("Сумма", ЗаписьРегистра.Сумма);

			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				НайденныйДокумент = Выборка.Ссылка;
				ТочностьПоиска = 100;
				КомментарийАлгоритма = "Найден документ по ИНН, дате, номеру и сумме. Точность: 100%";
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// --- Шаг 3: Поиск по ИНН, дате, сумме ---
	// Если найден только один документ, то точность 90. Если найдено более одного документа, то в качестве результата поиска берем первый и точность 90/КоличествоНайденныхДокументов.
	Если НайденныйДокумент = Неопределено Тогда

		Если НЕ ПустаяСтрока(ИННОрганизации) И НЕ ПустаяСтрока(ИННКонтрагента) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Документ.Ссылка
				|ИЗ
				|	Документ.%1 КАК Документ
				|ГДЕ
				|	Документ.Организация.ИНН = &ИННОрганизации
				|	И Документ.Контрагент.ИНН = &ИННКонтрагента
				|	И (Документ.Дата Между &НачалоДня И &КонецДня ИЛИ Документ.%2 Между &НачалоДня И &КонецДня)
				|	И Документ.СуммаДокумента = &Сумма";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ИмяТаблицыДокумента);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%2", ИменаПолейДатаНомер.ИмяДата);			
			Запрос.УстановитьПараметр("ИННОрганизации", ИННОрганизации);
			Запрос.УстановитьПараметр("ИННКонтрагента", ИННКонтрагента);
			Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ЗаписьРегистра.Дата));
			Запрос.УстановитьПараметр("КонецДня", КонецДня(ЗаписьРегистра.Дата));
			Запрос.УстановитьПараметр("Сумма", ЗаписьРегистра.Сумма);

			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			КоличествоНайденных = Выборка.Количество();
			
			Если КоличествоНайденных > 0 Тогда
				
				Выборка.Следующий();
				НайденныйДокумент = Выборка.Ссылка;
				
				Если КоличествоНайденных = 1 Тогда
					
					ТочностьПоиска = 90;
					КомментарийАлгоритма = "Найден документ по ИНН, дате и сумме. Точность: 90%";
					
				Иначе
					
					ТочностьПоиска = 90 / КоличествоНайденных;
					КомментарийАлгоритма = СтрШаблон("Найдено %1 документов по ИНН, дате и сумме. Выбран первый. Точность: %2%%", КоличествоНайденных, ТочностьПоиска);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// --- Шаг 4: Поиск по ИНН и дате (без суммы) ---
	// Если снова ничего не найдено, тогда ищем ещё раз, но без учета суммы документа и точность при этом 40/количество найденных.
	Если НайденныйДокумент = Неопределено Тогда

		Если НЕ ПустаяСтрока(ИННОрганизации) И НЕ ПустаяСтрока(ИННКонтрагента) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Документ.Ссылка
				|ИЗ
				|	Документ.%1 КАК Документ
				|ГДЕ
				|	Документ.Организация.ИНН = &ИННОрганизации
				|	И Документ.Контрагент.ИНН = &ИННКонтрагента
				|	И (Документ.Дата Между &НачалоДня И &КонецДня ИЛИ Документ.%2 Между &НачалоДня И &КонецДня)";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ИмяТаблицыДокумента);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%2", ИменаПолейДатаНомер.ИмяДата);			
			Запрос.УстановитьПараметр("ИННОрганизации", ИННОрганизации);
			Запрос.УстановитьПараметр("ИННКонтрагента", ИННКонтрагента);
			Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ЗаписьРегистра.Дата));
			Запрос.УстановитьПараметр("КонецДня", КонецДня(ЗаписьРегистра.Дата));

			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			КоличествоНайденных = Выборка.Количество();
			
			Если КоличествоНайденных > 0 Тогда
				
				Выборка.Следующий();
				НайденныйДокумент = Выборка.Ссылка;
				ТочностьПоиска = 40 / КоличествоНайденных;
				КомментарийАлгоритма = СтрШаблон("Найдено %1 документов по ИНН и дате. Выбран первый. Точность: %2%%", КоличествоНайденных, ТочностьПоиска);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	// --- Финальная обработка результата ---
	// Если что-то нашли, записываем ссылку на документ в поле ЗаписьРегистра.Объект. 
	// В поле ЗаписьРегистра.КомментарийОбработки добавляем новую строку с указанием первого сработавшего успешно алгоритма поиска и точностью метода.
	Если НайденныйДокумент <> Неопределено Тогда
		
		ЗаписьРегистра.Объект = НайденныйДокумент;
		
		ТекстКомментария = СтрШаблон("%1 (Найден: %2, точность: %3%%)", КомментарийАлгоритма, НайденныйДокумент, Формат(ТочностьПоиска, "ЧДЦ=2"));
		
		// Добавляем новый комментарий, сохраняя старый
		Если НЕ ПустаяСтрока(ЗаписьРегистра.КомментарийОбработки) Тогда
			
			ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки + Символы.ПС + ТекстКомментария;
			
		Иначе
			
			ЗаписьРегистра.КомментарийОбработки = ТекстКомментария;
			
		КонецЕсли;
	
		ТочностьСтрогогоПоиска = (ТочностьСтрогогоПоиска + ТочностьПоиска) / 2;
		
	Иначе
		// Если опять ничего не найдено, тогда считаем поиск неудачным.
		ТекстКомментария = "Документ не найден ни по одному из жестких алгоритмов поиска.";
		
		Если НЕ ПустаяСтрока(ЗаписьРегистра.КомментарийОбработки) Тогда
			
			ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки + Символы.ПС + ТекстКомментария;
			
		Иначе
			
			ЗаписьРегистра.КомментарийОбработки = ТекстКомментария;
			
		КонецЕсли;
		
		ТочностьСтрогогоПоиска = 0;
		
	КонецЕсли;
	
	

КонецПроцедуры

Процедура ОпределитьОрганизацию(ЗаписьРегистра, ОКПО, ИНН, ТочностьСтрогогоПоиска, ФлагИсходящийДокумент, ПереданИННПоставщика)
	
	Если ЗначениеЗаполнено(ЗаписьРегистра.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//Поиск организации
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	&ЗаполненИНН И (Организации.ИНН = &ИНН
	|	ИЛИ Организации.КодПоОКПО = &ИНН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	&ЗаполненОКПО И (Организации.ИНН = &ОКПО
	|	ИЛИ Организации.КодПоОКПО = &ОКПО)";
	
	Запрос.Параметры.Вставить("ИНН", ИНН);
	Запрос.Параметры.Вставить("ЗаполненИНН", НЕ ПустаяСтрока(ИНН));
	Запрос.Параметры.Вставить("ОКПО", ОКПО);
	Запрос.Параметры.Вставить("ЗаполненОКПО", НЕ ПустаяСтрока(ОКПО));
	
	ВыборкаОрганизаций = Запрос.Выполнить().Выбрать();
	
	КоличествоНайденных = ВыборкаОрганизаций.Количество();
	
	Если КоличествоНайденных = 0 Тогда
		
		ТочностьСтрогогоПоиска = 0;
		
	ИначеЕсли КоличествоНайденных = 1 Тогда
		
		ВыборкаОрганизаций.Следующий();
		ЗаписьРегистра.Организация = ВыборкаОрганизаций.Ссылка;
		
	Иначе
		
		ВыборкаОрганизаций.Следующий();
		ЗаписьРегистра.Организация = ВыборкаОрганизаций.Ссылка;
		ТочностьСтрогогоПоиска = ТочностьСтрогогоПоиска / КоличествоНайденных;
		
		ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки + ?(ПустаяСтрока(ЗаписьРегистра.КомментарийОбработки), "", Символы.ПС) + 
		"Найдено " + Строка(КоличествоНайденных) + " организаций с таким ИНН/ОКПО. Точность поиска " + Формат(ТочностьСтрогогоПоиска, "ЧДЦ=2;");
		
	КонецЕсли;	
	
	Если КоличествоНайденных > 0 И ПереданИННПоставщика Тогда

		ФлагИсходящийДокумент = Истина;
			
	КонецЕсли;
		
КонецПроцедуры

Процедура ОпределитьКонтрагента(ЗаписьРегистра, ОКПО, ИНН, ТочностьСтрогогоПоиска, ФлагИсходящийДокумент, ПереданИННКлиента)
	
	Если ЗначениеЗаполнено(ЗаписьРегистра.Контрагент) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//Поиск Контрагента
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ЗаполненИНН И (Контрагенты.ИНН = &ИНН
	|	ИЛИ Контрагенты.КодПоОКПО = &ИНН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	&ЗаполненОКПО И (Контрагенты.ИНН = &ОКПО
	|	ИЛИ Контрагенты.КодПоОКПО = &ОКПО)";
	

	Запрос.Параметры.Вставить("ИНН", ИНН);
	Запрос.Параметры.Вставить("ЗаполненИНН", НЕ ПустаяСтрока(ИНН));
	Запрос.Параметры.Вставить("ОКПО", ОКПО);
	Запрос.Параметры.Вставить("ЗаполненОКПО", НЕ ПустаяСтрока(ОКПО));
	
	ВыборкаКонтрагентов = Запрос.Выполнить().Выбрать();
	
	КоличествоНайденных = ВыборкаКонтрагентов.Количество();
	
	Если КоличествоНайденных = 0 Тогда
		
		ТочностьСтрогогоПоиска = 0;
		
	ИначеЕсли КоличествоНайденных = 1 Тогда
		
		ВыборкаКонтрагентов.Следующий();
		ЗаписьРегистра.Контрагент = ВыборкаКонтрагентов.Ссылка;
		
	Иначе
		
		ВыборкаКонтрагентов.Следующий();
		ЗаписьРегистра.Контрагент = ВыборкаКонтрагентов.Ссылка;
		ТочностьСтрогогоПоиска = ТочностьСтрогогоПоиска / КоличествоНайденных;
		
		ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки + ?(ПустаяСтрока(ЗаписьРегистра.КомментарийОбработки), "", Символы.ПС) +
		"Найдено " + Строка(КоличествоНайденных) + " контрагентов с таким ИНН/ОКПО. Точность поиска " + Формат(ТочностьСтрогогоПоиска, "ЧДЦ=2;");
		
	КонецЕсли;	
	
	//Логика такая: если флаг не был определен при определении организации и по переданному ИНН клиента нашли Контрагента, то вторая сторона - наша организация, т.е. она поставщик
	Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Организация) И ПереданИННКлиента И КоличествоНайденных > 0 Тогда

		ФлагИсходящийДокумент = Истина;
			
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоИзображениеИлиPDF(Расширение) Экспорт
		
	// Проверяем, является ли файл изображением или PDF файлом
	МассивДопустимыхРасширений = Новый Массив;
	МассивДопустимыхРасширений.Добавить(".jpg");
	МассивДопустимыхРасширений.Добавить(".jpeg");
	МассивДопустимыхРасширений.Добавить(".png");
	МассивДопустимыхРасширений.Добавить(".pdf");
	
	Возврат МассивДопустимыхРасширений.Найти(Расширение) <> Неопределено;
	
КонецФункции

Функция ПолучитьХешСуммуФайла(Знач ПолноеИмяФайла) Экспорт
	
	НужноУдалитьФайл = Ложь;
	
	Если ЭтоАдресВременногоХранилища(ПолноеИмяФайла) Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПолноеИмяФайла);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		ПолноеИмяФайла = ИмяВременногоФайла;
		
		НужноУдалитьФайл = Истина;
		
	КонецЕсли;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.ДобавитьФайл(ПолноеИмяФайла);
	ХешСумма = Строка(Хеш.ХешСумма);
	
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;
	
	Возврат ХешСумма;
	
КонецФункции

#КонецОбласти
